MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_rng.h
__STATIC_INLINE uint32_t LL_RNG_IsEnabledArdis(const RNG_TypeDef *rngx)
{
  return ((STM32_READ_BIT(rngx->CR, RNG_CR_ARDIS) != (RNG_CR_ARDIS)) ? 1UL : 0UL);
}
/** @defgroup RNG_LL_EF_Noise_Source_Configuration Noise Source Configuration
  * @{
  */
/**
  * @brief  Set RNG Noise Source Configuration.
  * @rmtoll
  *  NSCR       NSCR       LL_RNG_SetOscNoiseSrc
  * @param  rngx RNG Instance
  * @param  osc be one of the following values:
  *         @arg @ref LL_RNG_OSC_1
  *         @arg @ref LL_RNG_OSC_2
  *         @arg @ref LL_RNG_OSC_3
  * @param  src can be one of the following values:
  *         @arg @ref LL_RNG_NOISE_SRC_1
  *         @arg @ref LL_RNG_NOISE_SRC_2
  *         @arg @ref LL_RNG_NOISE_SRC_3
  */
__STATIC_INLINE void LL_RNG_SetOscNoiseSrc(RNG_TypeDef *rngx, uint32_t osc, uint32_t src)
{
  STM32_MODIFY_REG(rngx->NSCR, osc, (src << STM32_POSITION_VAL(osc)));
}
/**
  * @brief  Get RNG Noise Source Configuration.
  * @rmtoll
  *  NSCR       NSCR       LL_RNG_GetOscNoiseSrc
  * @param  rngx RNG Instance
  * @param  osc be one of the following values:
  *         @arg @ref LL_RNG_OSC_1
  *         @arg @ref LL_RNG_OSC_2
  *         @arg @ref LL_RNG_OSC_3
  * @retval can be one of the following values:
  *         @arg @ref LL_RNG_NOISE_SRC_1
  *         @arg @ref LL_RNG_NOISE_SRC_2
  *         @arg @ref LL_RNG_NOISE_SRC_3
  */
__STATIC_INLINE uint32_t LL_RNG_GetOscNoiseSrc(const RNG_TypeDef *rngx, uint32_t osc)
{
  return (STM32_READ_BIT(rngx->NSCR, osc) >> STM32_POSITION_VAL(osc));
}
/**
  * @}
  */
/** @defgroup RNG_LL_EF_Health_Test_Control Health Test Control
  * @{
  */
/**
  * @brief  Set RNG Health Test Control.
  * @rmtoll HTCR[0]       HTCFG       LL_RNG_SetHealthConfig
  * @param  rngx RNG Instance
  * @param  htcfg can be values of 32 bits
  */
__STATIC_INLINE void LL_RNG_SetHealthConfig(RNG_TypeDef *rngx, uint32_t htcfg)
{
  STM32_WRITE_REG(rngx->HTCR[0], htcfg);
}
/**
  * @brief  Get RNG Health Test Control.
  * @rmtoll HTCR[0]         HTCFG        LL_RNG_GetHealthConfig
  * @param  rngx RNG Instance
  * @retval Return 32-bit RNG Health Test configuration
  */
__STATIC_INLINE uint32_t LL_RNG_GetHealthConfig(const RNG_TypeDef *rngx)
{
  return (uint32_t)STM32_READ_REG(rngx->HTCR[0]);
}
/**
  * @brief  Set RNG additional Health Tests Control.
  * @rmtoll HTCR     htcr_idx       HTCFG       LL_RNG_SetHealthFactorConfig
  * @param  rngx       RNG Instance
  * @param  htcr_idx   Additional health tests registers index can be one of the following values
  *         @arg @ref LL_RNG_HTCR1
  *         @arg @ref LL_RNG_HTCR2
  *         @arg @ref LL_RNG_HTCR3
  * @param  htcfg      can be values of 32 bits
  */
__STATIC_INLINE void LL_RNG_SetHealthFactorConfig(RNG_TypeDef *rngx, uint32_t htcr_idx, uint32_t htcfg)
{
  STM32_WRITE_REG(rngx->HTCR[htcr_idx], htcfg);
}
/**
  * @brief  Get RNG additional Health Tests Control.
  * @rmtoll HTCR    htcr_idx      HTCFG        LL_RNG_GetHealthFactorConfig
  * @param  rngx       RNG Instance
  * @param  htcr_idx   Additional health tests registers index
  * @retval Return a 32-bit RNG additional health test configuration
  */
__STATIC_INLINE uint32_t LL_RNG_GetHealthFactorConfig(const RNG_TypeDef *rngx, uint32_t htcr_idx)
{
  return (uint32_t)STM32_READ_REG(rngx->HTCR[htcr_idx]);
}
/**
  * @brief  Get RNG Health Tests Status.
  * @rmtoll HTSR    htsr_idx      LL_RNG_GetHealthTestStatus
  * @param  rngx       RNG Instance
  * @param  htsr_idx   Health tests registers status index
  * @retval Return 32-bit RNG Health Test Status
  */
__STATIC_INLINE uint32_t LL_RNG_GetHealthTestStatus(const RNG_TypeDef *rngx, uint32_t htsr_idx)
{
  return (uint32_t)STM32_READ_REG(rngx->HTSR[htsr_idx]);
}
/**
  * @brief  Set RNG noise source mask.
  * @rmtoll NSMR    htsr_idx      LL_RNG_GetNoiseSourceMask
  * @param  rngx       RNG Instance
  * @param  nsmr      can be values of 32 bits
  */
__STATIC_INLINE void LL_RNG_SetNoiseSourceMask(RNG_TypeDef *rngx, uint32_t nsmr)
{
  STM32_WRITE_REG(rngx->NSMR, nsmr);
}
/**
  * @brief  Get RNG noise source mask.
  * @rmtoll NSMR    htsr_idx      LL_RNG_GetNoiseSourceMask
  * @param  rngx       RNG Instance
  * @retval Return 32-bit RNG Noise Source Mask
  */
__STATIC_INLINE uint32_t LL_RNG_GetNoiseSourceMask(const RNG_TypeDef *rngx)
{
  return (uint32_t)STM32_READ_REG(rngx->NSMR);
}

/**
  * @}
  */
/**
  * @}
  */
/**
  * @}
  */
#endif /* RNG */
/**
  * @}
  */
#ifdef __cplusplus
}
#endif /* __cplusplus */
#endif /* STM32C5XX_LL_RNG_H */
